import folium

coor = [
[" Preah Net Preah, Cambodia ", 13.5736 , 102.98259 ],
[" Bangkok, Thailand ", 13.752753 , 100.494086 ],
[" Phumi Banteay Neang, Cambodia ", 13.46665 , 103.01779 ],
[" Takou, Cambodia ", 10.987538 , 104.783565 ],
[" Phumi Angkor Borei, Cambodia ", 11.02028 , 104.95005 ],
[" Suong, Cambodia ", 11.88025 , 105.68541 ],
[" Phum Krek, Cambodia ", 11.52644 , 104.9876 ],
[" Kampot, Cambodia ", 10.617476 , 104.17992 ],
[" Ban Lung, Cambodia ", 13.741475 , 106.987366 ],
[" Baray, Cambodia ", 12.40085 , 105.07601 ],
[" Phumi Tonle Bati, Cambodia ", 11.58607 , 104.9281 ],
[" Roka Thom, Cambodia ", 11.47813 , 104.52717 ],
[" Prey Vêng, Cambodia ", 11.485623 , 105.336361 ],
[" Takong, Cambodia ", 11.45728 , 104.91722 ],
[" Komchay-Mea, Cambodia ", 39.390897 , -99.066067 ],
[" Kompong Trabek, Cambodia ", 11.14264 , 105.47873 ],
[" Angkor Borei, Cambodia ", 11.02028 , 104.95005 ],
[" Chhlong, Cambodia ", 11.45728 , 104.91722 ],
[" Chbar Mon, Cambodia ", 11.47736 , 104.4988 ],
[" Kirivôngs, Cambodia ", 11.45728 , 104.91722 ],
[" Prek Phnou, Cambodia ", 11.52897 , 104.98852 ],
[" Sihanoukville, Cambodia ", 10.622794 , 103.522831 ],
[" Phumi Siem Reap, Cambodia ", 13.47357 , 104.01816 ],
[" Phumi Chrey Thum, Cambodia ", 11.52819 , 104.98457 ],
[" Chhouk, Cambodia ", 10.837861 , 104.454052 ],
[" Kompong Thom, Cambodia ", 12.712624 , 104.889108 ],
[" Angtasom, Cambodia ", 11.45728 , 104.91722 ],
[" Pursat, Cambodia ", 12.537755 , 103.917824 ],
[" Kampong Cham, Cambodia ", 11.984249 , 105.463641 ],
[" Prey Krabas, Cambodia ", 11.63093 , 105.75495 ],
[" Kandal, Cambodia ", 11.396263 , 105.020902 ],
[" Kompong Tuol, Cambodia ", 13.01829 , 104.85902 ],
[" Svay Rieng, Cambodia ", 11.085968 , 105.793698 ],
[" Ta Khmau, Cambodia ", 11.4501 , 104.95623 ],
[" Chbar Mon, Cambodia ", 11.47736 , 104.4988 ],
[" Prey Lovea, Cambodia ", 11.15739 , 104.96047 ],
[" Battambang, Cambodia ", 13.099853 , 103.196666 ],
[" Siem Reap, Cambodia ", 13.345245 , 103.854163 ],
[" Somrong, Cambodia ", 11.58573 , 104.86933 ],
[" Phum Takê, Cambodia ", 11.52644 , 104.9876 ],
[" Takêv, Cambodia ", 10.987538 , 104.783565 ],
[" Tonleap, Cambodia ", 11.45728 , 104.91722 ],
[" Phnom Penh, Cambodia ", 11.563196 , 104.932875 ],
]

values = [
[ 2 , 0.21413276231263384 ],
[ 2 , 0.21413276231263384 ],
[ 2 , 0.21413276231263384 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 6 , 0.6423982869379015 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 3 , 0.32119914346895073 ],
[ 4 , 0.4282655246252677 ],
[ 4 , 0.4282655246252677 ],
[ 5 , 0.5353319057815845 ],
[ 6 , 0.6423982869379015 ],
[ 6 , 0.6423982869379015 ],
[ 6 , 0.6423982869379015 ],
[ 6 , 0.6423982869379015 ],
[ 6 , 0.6423982869379015 ],
[ 7 , 0.7494646680942184 ],
[ 7 , 0.7494646680942184 ],
[ 7 , 0.7494646680942184 ],
[ 7 , 0.7494646680942184 ],
[ 17 , 1.8201284796573876 ],
[ 8 , 0.8565310492505354 ],
[ 8 , 0.8565310492505354 ],
[ 9 , 0.9635974304068522 ],
[ 10 , 1.070663811563169 ],
[ 13 , 1.3918629550321198 ],
[ 13 , 1.3918629550321198 ],
[ 15 , 1.6059957173447537 ],
[ 24 , 2.569593147751606 ],
[ 40 , 4.282655246252676 ],
[ 55 , 5.8886509635974305 ],
[ 82 , 8.779443254817988 ],
[ 451 , 48.28693790149893 ],
]

total = 0
for x in range(len(values)):
  values[x][1] = "{:.2f}".format(values[x][1])
 
m = folium.Map(location=[coor[0][1], coor[0][2]])

for x in range(len(coor)):
  tooltip = coor[x][0] + ":" + str(values[x][0])
  folium.Marker(
      [coor[x][1], coor[x][2]], popup="<i>" + str(values[x][1]) +"%"+ "</i>", tooltip=tooltip, 
      icon= folium.Icon(color='darkblue', icon="user")
  ).add_to(m)


m.save("map.html")
